"use client"
import MainHeader from "@/base/mainHeader";

export default function GoalsPage() {
  return (
    <main
      style={{ maxWidth: "556px" }}
      className="mx-auto flex flex-col "
      dir="rtl"
    >
      <MainHeader />

      <p className="my-1   text-sm leading-7 text-gray-700">
        در من مارکت، هدف ما تنها فروش کالا نیست؛ ما به‌دنبال خلق تجربه‌ای
        لذت‌بخش، مطمئن و دوستانه در فرآیند خرید آنلاین هستیم. تیم پشتیبانی و
        مدیریتی ما با چشم‌اندازی بلندمدت و برنامه‌ریزی دقیق، مسیر توسعه فروشگاه
        را به‌گونه‌ای ترسیم کرده‌اند که اعتماد، وفاداری و رضایت مشتریان، در مرکز
        آن قرار داشته باشد.
      </p>

      <p className="my-1   text-sm leading-7 text-gray-700">
        ما باور داریم که موفقیت پایدار فقط با رضایت واقعی مشتریان و تبدیل آن‌ها
        به مشتریان وفادار و در نهایت مشتریان طرفدار به دست می‌آید.
      </p>

      <h5 className="text-base font-semibold   my-1">
        مهم‌ترین اهداف و اصول کاری ما در من مارکت:
      </h5>

      {goals.map((goal, index) => (
        <p key={index} className="my-1   text-sm leading-7 text-gray-700">
          {goal}
        </p>
      ))}
    </main>
  );
}

const goals = [
  "ارائه‌ی اطلاعات دقیق، کامل و به‌روز از کلیه محصولات",
  "عرضه‌ی کالاهایی که اعتبار آن‌ها از کیفیت واقعی‌شان می‌آید، نه صرفاً تبلیغات",
  "همکاری با تأمین‌کنندگان معتبر، باسابقه و دارای چشم‌انداز بلندمدت",
  "پاسخ‌گو بودن کامل من مارکت در برابر تمامی محصولات عرضه‌شده",
  "انتخاب برندهایی پایدار که حضورشان در بازار زودگذر و مقطعی نباشد",
  "تبدیل شدن به یک مرجع معتبر اطلاعات برای کاربران و حتی سایر فروشگاه‌ها",
  "پشتیبانی واقعی از مشتری، قبل، حین و پس از خرید",
  "همراهی خریداران در استفاده از خدمات گارانتی و پشتیبانی پس از فروش",
  "تضمین قیمت‌های رقابتی و موجودی به‌روز تمامی محصولات فروشگاه",
  "حمایت از حقوق خریداران در برابر شرکت‌های تأمین‌کننده یا گارانتی‌کننده",
  "ایفای نقش مسئولیت اجتماعی با هدف ایجاد ارزش‌افزوده برای جامعه مشتریان",
  "ایجاد آرامش در خرید با امکاناتی مانند: پرداخت آنلاین امن، ارسال سریع، تضمین اصالت و کیفیت کالا",
  "تلاش مداوم برای بهبود تجربه کاربری و ارتقاء کیفیت خدمات",
  "در من مارکت ما به آینده فکر می‌کنیم؛ آینده‌ای که در آن، مشتریان نه فقط خریدار، بلکه همراهان همیشگی ما باشند.",
];
